import Image from 'next/image'
import Link from 'next/link'
import React from 'react'
import banner1 from '@/public/assets/banner-2.jpg'

import { Button } from '@/components/ui/button'

const Header = () => {

    const headerContentDetails = {
        imageSrc: banner1,
        imageAlt: '',
        href: '/kitchen-hoods',
        blogTitle: 'غزو المطبخ بالوضوح: دليلك الشامل لأغطية المحركات',
        blogDescription: 'قهر المطبخ بوضوح: دليلك النهائي لشفاطات المطبخ شفاطات المطبخ هي الأبطال المجهولون في معارك الطهي. هؤلاء الحراس الصامتون، الذين يحومون فوق موقدك، يتعاملون مع الدخان والشحوم والروائح المنبعثة أثناء الطهي، مما يحافظ على مطبخك طازجًا وصحة رئتيك. ولكن مع وجود عدد كبير من الخيارات المتاحة، فإن اختيار غطاء المحرك المناسب يمكن أن يبدو وكأنه التنقل في متاهة. لا تخافوا يا عشاق الطعام! سيزودك هذا الدليل الشامل بالمعرفة اللازمة لاختيار شفاط المطبخ المثالي، وتحويل مساحة الطهي الخاصة بك إلى ملاذ للإبداع في الطهي. الكشف عن السبب: الدور الحيوي لشفاطات المطبخ تخيل أنك تقوم بحرق شرائح اللحم، أو تحضير الكاري العطري، أو الانغماس في وليمة مقلية. في حين أنها شهية، فإن مغامرات الطهي هذه تطلق العنان لسيل من الأعداء المحمولين بالهواء - الدخان والشحوم والبخار، وحتى الملوثات الضارة. يمكن أن يؤدي استنشاقها إلى تهيج عينيك ورئتيك، وإثارة الحساسية، وحتى إتلاف الأجزاء الداخلية من منزلك. أدخل غطاء المطبخ، مدافعك الشجاع ضد هؤلاء الضيوف غير المرغوب فيهم. إزالة الغموض عن الخيارات: مجموعة متنوعة من شفاطات المطبخ عالم شفاطات المطبخ متنوع مثل أذواقك في الطهي. وفيما يلي تفصيل للأنواع الرئيسية: الشفاطات الموجودة أسفل الخزانات: يتم وضعها بشكل خفي أسفل الخزانات، وهي مثالية للمطابخ الصغيرة. الشفاطات المثبتة على الحائط: الخيار الكلاسيكي، فهي توفر تهوية قوية وتأتي بأشكال مختلفة لتناسب ديكورك. شفاطات الجزيرة: مثالية للمطابخ المفتوحة أو الجزر، هذه الوحدات الأنيقة تتدلى من السقف، مما يدلي ببيان أثناء تنقية الهواء. شفاطات السحب السفلي: مدمجة في سطح الطهي الخاص بك، تختفي هذه الخيارات الأنيقة عند عدم استخدامها، مما يزيد من مساحة المنضدة. شفاطات إعادة التدوير: مثالية للشقق أو المساحات التي لا تحتوي على تهوية خارجية، حيث تقوم بتصفية الهواء وإعادة تدويره داخل مطبخك. اختيار بطلك: الاعتبارات الأساسية الآن بعد أن قابلت المتنافسين، حان الوقت لاختيار بطلك! فيما يلي العوامل الرئيسية التي يجب التفكير فيها:الحجم: تأكد من أن غطاء محرك السيارة الخاص بك يغطي سطح الطهي بالكامل لالتقاط الملوثات المحمولة بالهواء بشكل فعال. قوة التهوية: يتم قياسها بالقدم المكعب في الدقيقة (CFM)، ويشير ارتفاع CFM إلى قوة الشفط. قم بمطابقة CFM مع أسلوب الطبخ الخاص بك وحجم المطبخ. مستوى الضوضاء: اختر شفاطًا ذو تصنيف ديسيبل يناسب مستوى راحتك، خاصة إذا كنت تطبخ بشكل متكرر. المرشحات: اختر المرشحات التي يسهل تنظيفها واستبدالها. فكر في استخدام مرشحات الفحم لإعادة تدوير الأغطية. الإضاءة: تضيء مصابيح LED المدمجة سطح الطبخ الخاص بك، مما يعزز الرؤية ويضيف لمسة من الأناقة. الجماليات: اختر غطاءًا يكمل تصميم مطبخك وتفضيلاتك الشخصية. ما وراء الأساسيات: ميزات متقدمة للارتقاء بمطبخك توفر الشفاطات الحديثة مجموعة من الميزات لتعزيز تجربة الطهي الخاصة بك: التحكم في السرعة المتغيرة: اضبط قوة الشفط لتتناسب مع كثافة الطبخ لديك. مصابيح الحرارة: حافظ على دفء أطباقك أثناء الانتهاء من طهي العناصر الأخرى. جهاز التحكم عن بعد: قم بتشغيل غطاء محرك السيارة الخاص بك وأنت مستريح على كرسيك. إيقاف التشغيل التلقائي: يضمن إيقاف تشغيل غطاء المحرك بعد فترة زمنية محددة، مما يوفر الطاقة.  الاتصال الذكي: يمكنك التحكم في غطاء محرك السيارة الخاص بك ومراقبة أدائه من خلال هاتفك الذكي. رؤى التثبيت: ضمان الأداء الأمثل للحصول على الأداء الأمثل والسلامة، يعد التثبيت المناسب أمرًا بالغ الأهمية. استشر أحد المتخصصين المؤهلين للتأكد من تهوية غطاء محرك السيارة بشكل صحيح واستيفاءه لجميع قوانين البناء المحلية.   الحفاظ على بطلك: الحفاظ على غطاء محرك السيارة في أفضل حالات يعد التنظيف والصيانة المنتظمة أمرًا ضروريًا لضمان عمل غطاء المحرك بشكل فعال. قم بتنظيف المرشحات بانتظام، باتباع إرشادات الشركة المصنعة. امسح الجزء الخارجي للغطاء بقطعة قماش مبللة ومنظف معتدل. تذكر أن غطاء المحرك الذي يتم صيانته جيدًا هو غطاء سعيد وفعال! المخفقة النهائية: اختيار شفاط المطبخ المناسب لك مع هذا الدليل الشامل الموجود في ترسانتك، أنت مجهز للتغلب على معضلة شفاط المطبخ. تذكر أن الشفاط "الأفضل" هو الذي يتوافق تمامًا مع احتياجاتك وتفضيلاتك وميزانيتك. لذلك، ارتدي عباءة الطهي الخاصة بك، واحتضن الشيف بداخلك، ودع شفاط مطبخك يكون رفيقك الموثوق به في مغامراتك اللذيذة! نصيحة إضافية: ضع في اعتبارك تصميم مطبخك وعادات الطهي والميزانية عند اتخاذ قرارك. لا تتردد في استشارة المتخصصين للحصول على توصيات مخصصة. طبخ سعيد!',

    }
    return (

        <div className='w-full inline-block'>
            <div className='flex flex-col items-start justify-end mx-5 sm:mx-10 relative h-[60vh] sm:h-[85vh]'>
                <div className='absolute top-0 left-0 bottom-0 right-0 h-full
            bg-gradient-to-b from-transparent from-0% to-dark/90 rounded-3xl z-0
            ' />
                <Image src={headerContentDetails.imageSrc}
                    alt={headerContentDetails.imageAlt}
                    fill
                    className='opacity-60 w-full h-full object-center object-cover rounded-3xl -z-10'
                    sizes='100vw'
                    priority
                />

                <div className='w-full lg:w-3/4 p-6 sm:p-8 md:p-12  lg:p-16 flex flex-col items-start justify-center z-0 text-light'>

                    <Link href={headerContentDetails.href} className='mt-6 blog-title'>
                        <h1 className='font-bold capitalize text-lg sm:text-xl md:text-3xl lg:text-4xl'>
                            <span className='bg-gradient-to-r from-accent to-accent dark:from-accentDark/50 
                dark:to-accentDark/50 bg-[length:0px_6px]
                hover:bg-[length:100%_6px] bg-left-bottom bg-no-repeat transition-[background-size] duration-500 '>
                                {headerContentDetails.blogTitle}
                            </span>
                        </h1>
                    </Link>
                    <p className='hidden  sm:inline-block mt-4 md:text-lg lg:text-xl font-in'>
                        {headerContentDetails.blogDescription.length > 400 ? headerContentDetails.blogDescription.slice(0, 400) : headerContentDetails.blogDescription}....
                    </p>
                    <div className='flex items-center justify-center gap-x-2'>
                        <Button className='rounded-xl font-semibold px-2 py-1 border border-sky-500 bg-sky-800 text-white'>Food</Button>
                        <Button className='rounded-xl font-semibold px-2 py-1 border border-sky-500 bg-sky-800 text-white'>Kitchen</Button>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default Header