
import React from 'react'
import BlogContainer from '../blogContainer'
import { Metadata } from 'next';
import { Home } from 'lucide-react';
import Link from 'next/link';
import ContentTable from '@/app/(components)/contentTable';
import Image from 'next/image';
import image1 from '@/public/assets/history-of-chocolate.jpeg';
import cocoaBean from '@/public/assets/cocoa-bean.jpeg'



export const metadata: Metadata = {
  title: "أفضل الشوكولاتة: رحلة لذيذة لاكتشافها",
  description: "اكتشف أفضل أنواع الشوكولاتة في العالم! استكشف ملفات تعريف النكهات وأفضل العلامات التجارية ونصائح للعثور على علاجك المثالي.",
};
const HistoryOfChocolate = () => {

  const tableContents = [
    { title: 'أفضل شوكولاتة في العالم: دليل شامل' },
    { title: "رحلة عبر الزمن: التاريخ الساحر للشوكولاتة" },
    { title: "فن صياغة الشوكولاتة: من الفول إلى البار" },
    { title: "عالم من الاختيارات: استكشاف المناظر الطبيعية المتنوعة لشركات الشوكولاتة" },
    { title: "إزالة الغموض عن المكونات: الكشف عن الأسرار الكامنة وراء جاذبية الشوكولاتة" },
    { title: "التنقل في ممر الشوكولاتة: دليل لفئات مختلفة" },
    { title: "ما وراء الانغماس: التأثير الشامل للشوكولاتة" },
    { title: "الخلاصة: احتفال بالشوكولاتة بجميع أشكالها" }


  ]
  return (
    <>
      <BlogContainer className='text-right mx-2 md:mx-16 py-32'>
        <div className='flex items-center gap-x-4 py-7 text-lg'>
          <Link href={'/'}><Home className='h-4 w-4' /></Link> / <Link href={'/best-chocolate'}>Best Chocolate</Link>
        </div>
        <div className='grid grid-cols-12 gap-x-5'>
          <div className="col-span-12  lg:col-span-4">
            <details
              className="border-[1px] border-solid border-dark dark:border-light text-dark dark:text-light rounded-lg p-4 sticky top-16 max-h-[80vh] overflow-hidden overflow-y-auto"
              open
            >
              <summary className="text-lg font-semibold capitalize cursor-pointer">
                قائمة المحتويات
              </summary>
              <ul className="mt-4 font-in text-base">
                {
                  tableContents.map((heading, index) => (
                    <ContentTable key={index} heading={heading} />
                  ))
                }
              </ul>
            </details>
          </div>
          <div className='col-span-12 lg:col-span-8'>
            <h1 className='font-bold text-2xl text-[#00563B]'>أفضل شوكولاتة في العالم: دليل شامل</h1>
            <div className='my-10' id='أفضل شوكولاتة في العالم: دليل شامل'>
              <div className='flex justify-end'>
                <Image className='w-full h-[400px] object-fill' src={image1} alt='cocoa bean' />
              </div>
              <span className='cursor-pointer text-sky-400'>source: <Link href={'https://unsplash.com/'} >unsplash.com</Link></span>
            </div>
            <article>
              <p className='text-lg'>الشوكولاتة، الكلمة نفسها تثير سلسلة من الأحاسيس المبهجة - قوام كريمي، وروائح غنية، ووعد بالانغماس الخالص. لكن هذه المعالجة المنتشرة في كل مكان تفتخر بتاريخ غني ومعقد مثل نكهتها. من أصولها القديمة إلى الأصناف المتنوعة التي تزين أرفف المتاجر اليوم، أسرت الشوكولاتة الثقافات في جميع أنحاء العالم لآلاف السنين. يتعمق هذا الدليل الشامل في عالم الشوكولاتة الرائع، ويستكشف تاريخها، وفن صناعة قالب الشوكولاتة المثالي، والمناظر الطبيعية المتنوعة لشركات الشوكولاتة، والمكونات الرئيسية التي تجعل هذه الحلوى المحبوبة تنبض بالحياة.</p>

              <div className='py-4' id='رحلة عبر الزمن: التاريخ الساحر للشوكولاتة'>
                <h2 className='text-xl font-bold pb-2 pt-4 text-[#00563B]'>رحلة عبر الزمن: التاريخ الساحر للشوكولاتة</h2>
                <p className='text-lg py-4'>تتكشف قصة الشوكولاتة في أمريكا الوسطى، حيث نشأت <Link href={'https://en.wikipedia.org/wiki/Cocoa_bean'} className='font-bold hover:underline'>حبوب الكاكاو</Link>، أساس الشوكولاتة. ويعتقد أن حضارة الأولمك (1800-400 قبل الميلاد) هي أول من استهلك الشوكولاتة، واستخدمها في المشروبات الاحتفالية المملوءة بالماء والفلفل الحار. قام المايا (2000 قبل الميلاد - 900 م) بتحسين استخدام <Link href={'https://en.wikipedia.org/wiki/Cocoa_bean'}>حبوب الكاكاو، </Link> وطحنها إلى عجينة ودمجها في المشروبات والعروض الطقسية.</p>
                <p className='text-lg py-2'>لننتقل سريعًا إلى الأزتيك (1300-1521 م)، الذين كانوا يقدسون الشوكولاتة باعتبارها طعامًا للآلهة. لقد تناولوا مشروبًا مريرًا ورغويًا يسمى &quot;xocolatl&quot;، مصنوع من حبوب الكاكاو المطحونة ودقيق الذرة والفلفل الحار والتوابل. يُعتقد أن هذا المشروب القوي يمتلك خصائص منشطة وكان مخصصًا للنبلاء والمحاربين.</p>
                <p className='text-lg py-2'>كان وصول الغزاة الإسبان في القرن السادس عشر بمثابة نقطة تحول في تاريخ الشوكولاتة. لقد اعتمدوا مشروب الأزتك، مضيفين السكر وغيروا الوصفة لتناسب أذواقهم. اكتسبت هذه النسخة الأكثر حلاوة من الشوكولاتة شعبية في أوروبا، وتطورت في النهاية إلى ألواح الشوكولاتة الصلبة التي نعرفها ونحبها اليوم.</p>
              </div>

              <div className='py-4' id='فن صياغة الشوكولاتة: من الفول إلى البار'>
                <h2 className='font-bold text-xl text-[#00563B]'>فن صياغة الشوكولاتة: من الفول إلى البار</h2>
                <div className='flex justify-end'>
                  <Image className='w-full h-[400px] object-fill' src={cocoaBean} alt='cocoa bean' />
                </div>
                <p className='py-4'>إن تحويل حبة الكاكاو المتواضعة إلى لوح شوكولاتة منحل ينطوي على عملية دقيقة تتطلب الخبرة والاهتمام الدقيق بالتفاصيل. فيما يلي لمحة عن المراحل الرئيسية لصنع الشوكولاتة:</p>
                <ul className='list-disc'>
                  <li className='arabic-li'><span className='font-bold'>التوريد والتحميص:</span>تبدأ الرحلة باختيار حبوب الكاكاو عالية الجودة، والتي غالبًا ما تكون من مناطق محددة معروفة بنكهاتها الفريدة. يتم بعد ذلك تحميص هذه الحبوب بعناية لتعزيز رائحتها وتطوير نكهات الشوكولاتة المميزة.</li>
                  <li className='arabic-li'><span className='font-bold'>التذرية والطحن:</span>بعد التحميص، تتم إزالة القشرة من الحبوب من خلال عملية تسمى التذرية. يتم بعد ذلك طحن حبيبات الكاكاو المتبقية جيدًا للحصول على عجينة سميكة تعرف باسم كتلة الكاكاو.</li>
                  <li className='arabic-li'><span className='font-bold'>محارة:</span>تتضمن هذه الخطوة الحاسمة تحريك كتلة الكاكاو وتهويتها لفترة طويلة. تعمل هذه العملية على تحسين الملمس وتقليل المرارة وتطوير نكهة الشوكولاتة الفريدة.</li>
                  <li className='arabic-li'><span className='font-bold'>هدأ:</span>للحصول على لمسة نهائية ناعمة ولامعة وملمس مرضي، تخضع الشوكولاتة لعملية دقيقة يتم التحكم في درجة حرارتها تُعرف باسم التقسية.</li>
                  <li className='arabic-li'><span className='font-bold'>صب والتعبئة والتغليف:</span>أخيرًا، تُسكب الشوكولاتة المُخففة في قوالب وتُبرد، لتأخذ شكل ألواح أو رقائق أو أي أشكال أخرى مرغوبة. يتم بعد ذلك تعبئة المنتج النهائي وتجهيزه لرحلته إلى محبي الشوكولاتة في جميع أنحاء العالم.</li>
                </ul>
              </div>

              <div className='py-4' id='عالم من الاختيارات: استكشاف المناظر الطبيعية المتنوعة لشركات الشوكولاتة'>
                <h2>عالم من الاختيارات: استكشاف المناظر الطبيعية المتنوعة لشركات الشوكولاتة</h2>
                <p>تفتخر صناعة الشوكولاتة العالمية بوجود العديد من الشركات، حيث تساهم كل منها بنكهات وابتكارات فريدة في عالم الشوكولاتة. فيما يلي بعض الأمثلة الجديرة بالملاحظة:</p>
                <ul className="list-disc">
                  <li className='arabic-li'><span className='font-bold'>هيرشي (الولايات المتحدة الأمريكية):</span>اسم مألوف مرادف لشوكولاتة الحليب الكريمية، هيرشي يأسر براعم التذوق الأمريكية منذ عام 1894.</li>
                  <li className='arabic-li'><span className='font-bold'>ليندت (سويسرا): </span>تشتهر شوكولاتة ليندت بملمسها الناعم الذي يذوب في الفم، وهي مصنوعة من مكونات عالية الجودة وتأتي في مجموعة متنوعة من النكهات اللذيذة.</li>
                  <li className='arabic-li'><span className='font-bold'>جوديفا (بلجيكا):</span>تشتهر شوكولاتة جوديفا بشوكولاتةها الفاخرة وتغليفها الرائع، وهي رمز للتدليل وغالبًا ما تعتبر خيارًا متميزًا.</li>
                  <li className='arabic-li'><span className='font-bold'>غيرارديلي (الولايات المتحدة الأمريكية):</span>تقدم تجربة شوكولاتة غنية ومكثفة، شوكولاتة غيرارديللي مصنوعة من محتوى عالي من الكاكاو وتلبي الأذواق التي تبحث عن نكهة أكثر جرأة.</li>
                  <li className='arabic-li'><span className='font-bold'>توني تشوكولوني (هولندا):</span>تدعم هذه الشركة ذات الوعي الاجتماعي الكاكاو من مصادر أخلاقية وممارسات التجارة العادلة، وتقدم الشوكولاتة اللذيذة بينما تدعو إلى صناعة كاكاو مستدامة وعادلة.</li>

                </ul>
              </div>

              <div className='py-4' id='إزالة الغموض عن المكونات: الكشف عن الأسرار الكامنة وراء جاذبية الشوكولاتة'>
                <h2 className='font-bold text-xl text-[#00563B]'>إزالة الغموض عن المكونات: الكشف عن الأسرار الكامنة وراء جاذبية الشوكولاتة</h2>
                <p>يكمن سحر الشوكولاتة في مزيجها الفريد من المكونات، التي يلعب كل منها دورًا حاسمًا في مذاقها وملمسها:</p>
                <ul className="list-disc">
                  <li className='arabic-li'><span className="font-bold">حبوب الكاكاو:</span>أساس جميع أنواع الشوكولاتة، حبوب الكاكاو تأتي في أنواع مختلفة، كل منها يساهم في نكهة ورائحة مميزة. تحدد نسبة المواد الصلبة للكاكاو في الشوكولاتة مرارتها، حيث توفر النسب الأعلى نكهة شوكولاتة أكثر كثافة.</li>
                  <li className='arabic-li'><span className="font-bold">زبدة الكاكاو:</span>تضفي زبدة الكاكاو المستخرجة من حبوب الكاكاو ملمسًا ناعمًا وكريميًا وملمسًا فاخرًا على الشوكولاتة.</li>
                  <li className='arabic-li'><span className="font-bold">سكر:</span>يحلي الشوكولاتة ويوازن مرارة الكاكاو.</li>
                  <li className='arabic-li'><span className="font-bold">الحليب (في شوكولاتة الحليب):</span>يضيف كريمة وحلاوة مميزة إلى شوكولاتة الحليب، مما يخلق نكهة أكثر اعتدالًا ويسهل الوصول إليها مقارنة بالشوكولاتة الداكنة.</li>
                  <li className='arabic-li'><span className="font-bold">الليسيثين:</span>مستحلب يساعد على مزج زبدة الكاكاو والمكونات الأخرى، مما يضمن الحصول على ملمس ناعم ومتماسك.</li>
                  <li className='arabic-li'><span className="font-bold">فانيلا:</span>غالبًا ما يستخدم مستخلص الفانيليا بكميات صغيرة، وهو يعزز تعقيد النكهة الطبيعية للشوكولاتة ويضيف حلاوة خفيفة.</li>
                  <li className='arabic-li'><span className="font-bold">المكونات الإضافية:</span>اعتمادًا على نوع الشوكولاتة المحدد، يمكن دمج مكونات إضافية مثل المكسرات والفواكه والتوابل والمنكهات الأخرى لإنشاء مجموعات نكهات فريدة.</li>
                </ul>
              </div>

              <div className='py-4' id='التنقل في ممر الشوكولاتة: دليل لفئات مختلفة'>
                <h2 className='font-bold text-xl pt-1 pb-2'>التنقل في ممر الشوكولاتة: دليل لفئات مختلفة</h2>
                <p className='py-2'>يمتد عالم الشوكولاتة إلى ما هو أبعد من ألواح شوكولاتة الحليب الكلاسيكية. فيما يلي تفاصيل الفئات الرئيسية التي ستواجهها عند استكشاف ممر الشوكولاتة:</p>
                <ul className="list-disc">
                  <li className='arabic-li'><span className='font-bold'>الشوكولاته الداكنة:</span>تحتوي هذه الفئة على أعلى نسبة من الكاكاو تتراوح من 70% إلى 100%. تقدم الشوكولاتة الداكنة نكهة شوكولاتة أكثر ثراءً وأكثر كثافة مع ملاحظات من المرارة والتعقيد.</li>
                  <li className='arabic-li'><span className='font-bold'>شوكولاتة الحليب:</span>تتميز هذه الفئة الشائعة بتوازن مواد الكاكاو الصلبة وزبدة الكاكاو والحليب والسكر. ويتميز بمذاق حلو وكريمي، مما يجعله المفضل لدى العديد من محبي الشوكولاتة.</li>
                  <li className='arabic-li'><span className='font-bold'>شوكولاته بيضاء:</span>خلافًا للاعتقاد الشائع، لا تحتوي الشوكولاتة البيضاء في الواقع على مواد كاكاو صلبة، بل تحتوي على زبدة الكاكاو والسكر والحليب والمنكهات. له طعم حلو كريمي وملمس ناعم.</li>
                  <li className='arabic-li'><span className='font-bold'>روبي الشوكولاته:</span>تتميز هذه الفئة الجديدة نسبياً بلون وردي فريد وطعم حلو وفاكهي طبيعي دون إضافة نكهات أو ألوان صناعية.</li>
                  <li className='arabic-li'><span className='font-bold'>الشوكولاتة المخلوطة:</span>تشمل هذه الفئة مجموعة واسعة من الشوكولاتة الممزوجة بمكونات إضافية مثل المكسرات والفواكه والتوابل والكراميل والمزيد. تلبي هذه الخيارات التفضيلات المتنوعة وتقدم مجموعات نكهة مثيرة.</li>
                </ul>
              </div>

              <div className='py-4' id='ما وراء الانغماس: التأثير الشامل للشوكولاتة'>
                <h2>ما وراء الانغماس: التأثير الشامل للشوكولاتة</h2>
                <p>يمتد تأثير الشوكولاتة إلى ما هو أبعد من عالم التساهل الخالص. وله دور كبير في مختلف جوانب حياتنا، بما في ذلك:</p>
                <ul className="list-disc">
                  <li className='arabic-li'><span className='font-bold'>أهمية ثقافية:</span>لقد تم نسج الشوكولاتة في النسيج الثقافي للمجتمعات في جميع أنحاء العالم، وغالبًا ما ترتبط بالاحتفالات والطقوس الدينية والتقاليد.</li>
                  <li className='arabic-li'><span className='font-bold'>الأثر الاقتصادي:</span>توظف صناعة الكاكاو ملايين الأشخاص في جميع أنحاء العالم، وخاصة في الدول النامية. تعد ممارسات التوريد المستدامة والأخلاقية أمرًا بالغ الأهمية لضمان رفاهية مزارعي الكاكاو ومستقبل الصناعة.</li>
                  <li className='arabic-li'><span className='font-bold'>الفوائد الصحية:</span>على الرغم من أنها تعتبر في كثير من الأحيان علاجًا ممتعًا، إلا أن الشوكولاتة الداكنة باعتدال توفر فوائد صحية معينة، ومن المحتمل أن تساهم في تحسين الوظيفة الإدراكية وصحة القلب (عند تناولها باعتدال وكجزء من نظام غذائي متوازن).</li>
                </ul>
              </div>

              <div className='font-lg py-4' id='الخلاصة: احتفال بالشوكولاتة بجميع أشكالها'>
                <h2 className='font-bold text-xl'>الخلاصة: احتفال بالشوكولاتة بجميع أشكالها</h2>
                <p className='py-2'>إن عالم الشوكولاتة عبارة عن نسيج غني منسوج من التاريخ والتقاليد والابتكارات الطهوية. من عملية التصنيع الدقيقة إلى الأصناف المتنوعة التي تزين أرفف المتاجر، تستمر الشوكولاتة في أسر حواسنا وإثارة فضولنا. سواء كنت من عشاق الشوكولاتة المخضرمين أو بدأت استكشافك للتو، فإن هذا الدليل الشامل يزودك بالمعرفة والتقدير للتنقل في عالم الشوكولاتة وتذوق العديد من المأكولات اللذيذة.</p>
              </div>

            </article>
          </div>
        </div>
      </BlogContainer>
    </>
  )
}

export default HistoryOfChocolate